package com.fct.daily.dailylearn.common;

/**
 * TODO
 *
 * @author xstarfct
 * @version 2020-07-03 11:09 上午
 */
public class JsonLogisticsTest {
    
    String data = "{\"express_company\":\"sf\",\"express_company_name\":\"顺丰\",\"express_context\":[{\"created_at\":\"2020-06-18 18:16:14\",\"context\":\"【丽水市】在官网\\\"运单资料&签收图\\\",可查看签收人信息\"},{\"created_at\":\"2020-06-18 18:16:11\",\"context\":\"【丽水市】您的快件已签收，如有疑问请电联小哥【厉俊晓，电话：15990451183】。疫情期间顺丰每日对网点消毒、小哥每日测温、配戴口罩，感谢您使用顺丰，期待再次为您服务。>（主单总件数：7件）\"},{\"created_at\":\"2020-06-18 17:02:16\",\"context\":\"【丽水市】快件交给厉俊晓,正在派送途中（联系电话：15990451183,顺丰已开启“安全呼叫”保护您的电话隐私,请放心接听！）（主单总件数：7件）\"},{\"created_at\":\"2020-06-18 16:39:50\",\"context\":\"【丽水市】正在派送途中,请您准备签收(派件人:厉俊晓,电话:15990451183)\"},{\"created_at\":\"2020-06-18 16:30:14\",\"context\":\"【丽水市】快件到达 【青田集配站】\"},{\"created_at\":\"2020-06-18 14:26:30\",\"context\":\"【丽水市】快件已发车\"},{\"created_at\":\"2020-06-18 14:26:23\",\"context\":\"【丽水市】快件在【丽水水阁中转场】已装车,准备发往 【青田集配站】\"},{\"created_at\":\"2020-06-18 11:53:12\",\"context\":\"【丽水市】快件到达 【丽水水阁中转场】\"},{\"created_at\":\"2020-06-18 04:40:54\",\"context\":\"【金华市】快件已发车\"},{\"created_at\":\"2020-06-18 04:09:22\",\"context\":\"【金华市】快件在【金华快运中转场】已装车,准备发往 【丽水水阁中转场】\"},{\"created_at\":\"2020-06-17 23:04:01\",\"context\":\"【金华市】快件到达 【金华快运中转场】\"},{\"created_at\":\"2020-06-17 21:58:02\",\"context\":\"【金华市】快件已发车\"},{\"created_at\":\"2020-06-17 20:58:50\",\"context\":\"【金华市】快件在【义乌集配站】已装车,准备发往 【金华快运中转场】\"},{\"created_at\":\"2020-06-17 20:21:03\",\"context\":\"【金华市】顺丰速运 >已收取快件\"},{\"created_at\":\"2020-06-17 19:55:46\",\"context\":\"【金华市】顺丰速运 已收取快件\"}],\"express_no\":\"SF1025141750960\",\"out_trade_no\":\"XHXFH159231788348552988966\",\"status\":\"3\",\"timestamp\":\"1593720154608\"}";
    /****
    {\"express_company\":\"sf\",\"express_company_name\":\"顺丰\",\"express_context\":[{\"created_at\":\"2020-06-18 18:16:14\",\"context\":\"【丽水市】在官网运单资料&签收图,可查看签收人信息\"},{\"created_at\":\"2020-06-18 18:16:11\",\"context\":\"【丽水市】您的快件已签收，如有疑问请电联小哥【厉俊晓，电话：15990451183】。疫情期间顺丰每日对网点消毒、小哥每日测温、配戴口罩，感谢您使用顺丰，期待再次为您服务。（主单总件数：7件）\"},{\"created_at\":\"2020-06-18 17:02:16\",\"context\":\"【丽水市】快件交给厉俊晓,正在派送途中（联系电话：15990451183,顺丰已开启“安全呼叫”保护您的电话隐私,请放心接听！）（主单总件数：7件）\"},{\"created_at\":\"2020-06-18 16:39:50\",\"context\":\"【丽水市】正在派送途中,请您准备签收(派件人:厉俊晓,电话:15990451183)\"},{\"created_at\":\"2020-06-18 16:30:14\",\"context\":\"【丽水市】快件到达 【青田集配站】\"},{\"created_at\":\"2020-06-18 14:26:30\",\"context\":\"【丽水市】快件已发车\"},{\"created_at\":\"2020-06-18 14:26:23\",\"context\":\"【丽水市】快件在【丽水水阁中转场】已装车,准备发往 【青田集配站】\"},{\"created_at\":\"2020-06-18 11:53:12\",\"context\":\"【丽水市】快件到达 【丽水水阁中转场】\"},{\"created_at\":\"2020-06-18 04:40:54\",\"context\":\"【金华市】快件已发车\"},{\"created_at\":\"2020-06-18 04:09:22\",\"context\":\"【金华市】快件在【金华快运中转场】已装车,准备发往 【丽水水阁中转场】\"},{\"created_at\":\"2020-06-17 23:04:01\",\"context\":\"【金华市】快件到达 【金华快运中转场】\"},{\"created_at\":\"2020-06-17 21:58:02\",\"context\":\"【金华市】快件已发车\"},{\"created_at\":\"2020-06-17 20:58:50\",\"context\":\"【金华市】快件在【义乌集配站】已装车,准备发往 【金华快运中转场】\"},{\"created_at\":\"2020-06-17 20:21:03\",\"context\":\"【金华市】顺丰速运 >已收取快件\"},{\"created_at\":\"2020-06-17 19:55:46\",\"context\":\"【金华市】顺丰速运 已收取快件\"}],\"express_no\":\"SF1025141750960\",\"out_trade_no\":\"XHXFH159231788348552988966\",\"status\":\"3\",\"timestamp\":\"1593720154608\"}
     
     */
    
}
